import { Component, OnInit } from '@angular/core';

@Component({
  selector: 'app-blog-list',
  templateUrl: './blog-list.component.html',
  styleUrls: ['./blog-list.component.scss']
})
export class BlogListComponent implements OnInit {

  public blogList = [
    {
      tags: ['#Angular', 'プログラミング'],
      date: '2020-08-04',
      title: '【Angular】ブログシステムを作ってみた',
      thumbnail: '',
      summary: 'サマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリ'
    },
    {
      tags: ['#Angular', 'プログラミング'],
      date: '2020-08-04',
      title: '【Angular】ブログシステムを作ってみた',
      thumbnail: '',
      summary: 'サマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリサマリ'
    }

  ];

  constructor() { }

  ngOnInit(): void {
  }

}
